app/Controllers/Artikel.php

SELECT *
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `artikel`
WHERE `judul` LIKE '%%' ESCAPE '!'
---
  public function admin_index()
  {
    $title = 'Daftar Artikel';
    $q = $this->request->getVar('q') ?? '';
    $model = new ArtikelModel();
    $data = [
      'title' => $title,
      'q' => $q,
      'artikel' => $model->like('judul', $q)->paginate(10), # datadibatasi 10 record per halaman

INSERT INTO `artikel` (`judul`, `isi`, `slug`) VALUES ('mxcdh@yahoo.com', 'ester fiorina', 'mxcdhyahoocom')
---
  public function add()
  {
    // validasi data.
    $validation = \Config\Services::validation();
    $validation->setRules(['judul' => 'required']);
    $isDataValid = $validation->withRequest($this->request)->run();
    $judul = $this->request->getPost('judul');
    $isi = $this->request->getPost('isi');
    if ($isDataValid) {
      if (is_string($judul) && is_string($isi)) {
        $artikel = new ArtikelModel();
        $artikel->insert([
          'judul' => $judul,
          'isi' => $isi,
          'slug' => url_title($judul),
        ]);